
<h2>最新消息</h2>

<h2>重要公告</h2>
<ul>
	<li>進階班(資結演算法)的<a href="http://www.lkm543.site/Course/DS_AL/">連結</a>，帳號DSAL、密碼ILOVEDSAL</li>
	<li>本門課的<a href="https://discord.gg/vY9NU53Mzn">Discord連結</a></li>
	<li>不是本門課但可以參考的<a href="https://www.facebook.com/%E7%94%9F%E6%B4%BB%E4%B8%AD%E7%9A%84%E7%A8%8B%E5%BC%8F-108418124301138">粉絲專頁</a></li>
	<li>無線網路Wifi帳號密碼(2020下半年)</li>
	<ul>
		<li>SSID：CSIE_guest</li>
		<li>帳號：guest_W76TG</li>
		<li>密碼：BCC6VSD7</li>
	</ul>
</ul>

<h2>2020/11/15</h2>
<ul>
	<li><a href="/Course/Cpp/Download/Final.pdf">期末考試(六選一題)</a>已上傳至Download區，完成後在今天(11/15)前寄至lkm543@gmail.com</li>
	<li>期末考試<a href="/Course/Cpp/Download/Final_P1_Hint.cpp">第一題的提示</a></li>
	<li>請幫忙至<a href="https://train.csie.ntu.edu.tw/train/">訓練班網站</a>登入後填個問券</li>	
	<li>作業的繳交期限也是今天(11/15)午夜12點</li>
	<li>(工商服務)有興趣研究資結演算法的話可以來修<a href="https://train.csie.ntu.edu.tw/train/course.php?id=3074">進階班</a></li>
</ul>

<h2>2020/10/18</h2>
<ul>
	<li>章節的最後新增APCS題目供有意應試的同學參考</a></li>
</ul>

<h2>2020/10/17</h2>
<ul>
	<li>335期<a href="https://bit.ly/31gkB9F">期初問卷</a></li>
</ul>

<h2>2020/07~09</h2>
<ul>
	<li>因國考與系館維修工程進行，停開課程三期</li>
</ul>

<h2>2020/06/16</h2>
<ul>
	<li>328期的期末考已批改&回傳完畢，若有同學沒收到的話請回信告知。</li>
	<li>最近開了一個<a href="https://www.facebook.com/%E7%94%9F%E6%B4%BB%E4%B8%AD%E7%9A%84%E7%A8%8B%E5%BC%8F-108418124301138">粉絲專頁</a>固定寫些程式相關的入門或是應用知識，有空的話可以參考</li>
</ul>

<h2>2020/05/18</h2>
<ul>
	<li>開了一個Discord來試用，以後有問題想問or意見想反應or想討論可以在上面進行。(<a href="https://discord.gg/gFPMe6G">Discord連結</a>)</li>
</ul>

<h2>2020/05/10</h2>
<ul>
	<li>326期的期末考已批改&回傳完畢，若有同學沒收到的話請回信告知。</li>
	<li>326期的課程到此告一段落，同學有緣再見，有問題的話也歡迎寄email給我。</li>
</ul>

<h2>2020/04/24</h2>
<ul>
	<li>新增第15章的課程後記喔！因為時間有限所以第15章的內容不會在教室講授，大家有意願的話就看線上吧！</li>
</ul>

<h2>2020/03/28</h2>
<ul>
	<li>325期的期末考已批改&回傳完畢，若有同學沒收到的話請回信告知。</li>
</ul>

<h2>2020/03/21</h2>
<ul>
	<li><a href="/Course/Cpp/Download/Final.pdf">期末考試(六選一題)</a>已上傳至Download區，完成後在周日(3/22)前寄至lkm543@gmail.com</li>
	<li>期末考試<a href="/Course/Cpp/Download/Final_P1_Hint.cpp">第一題的提示</a></li>
	<li>作業的繳交期限也是明天(3/22)午夜12點</li>
</ul>

<h2>2020/03/14</h2>
<ul>
	<li>重錄的課程影片都上線了喔!</li>
	<li>十分抱歉我上課忘記發收據了，收據會於下周六期末時發</li>
</ul>

<h2>2020/02/23</h2>
<ul>
	<li>下周遇到228連假停課一周(2/29、3/01都停課一次)，課程會順延。</li>
</ul>

<h2>2020/02/12</h2>
<ul>
	<li>324期的期末考已批改&回傳完畢，若有同學沒收到的話請回信告知。</li>
	<li>324期的課程到此告一段落，同學有緣再見，有問題的話也歡迎寄email給我。</li>
</ul>

<h2>2020/02/09</h2>
<ul>
	<li>325期下周六(02/15)因補班日暫停上課，課程順延，下周日(02/16)照常上課。</li>
</ul>

<h2>2020/02/01</h2>
<ul>
	<li><a href="/Course/Cpp/Download/Final2.pdf">期末考試(六選一題)</a>與<a href="/Course/Cpp/Download/Final_P1_Hint.cpp">第一題的提示</a>已上傳，完成後在下周日(02/09)前寄至lkm543@gmail.com</li>
	<li>非常抱歉今天資工系館未開放</li>
</ul>

<h2>2020/01/22</h2>
<ul>
	<li>作業的參考答案已上傳至<a href="/Course/Cpp/Download/">Download區</a>。</li>
</ul>

<h2>2020/01/10</h2>
<ul>
	<li>明日1/11(六)因為大選停課一天，有投票權的記得回去投票R</li>
</ul>

<h2>2020/01/02</h2>
<ul>
	<li>應同學反應修改作業2-3的敘述</li>
</ul>

<h2>2019/12/20</h2>
<ul>
	<li>課程講義與影片已更新</li>
	<li>移除物件部分，補充部分語法與內容</li>
</ul>

<h2>2019/11/11</h2>
<ul>
	<li>320期期末考試已批改完畢，若無收到回信請告知</li>
</ul>

<h2>2019/09/29</h2>
<ul>
	<li>10/05(六)因為補班補課所以停課一次</li>
	<li>10/06(日)照常上課</li>
	<li>10/12(六)、13(日)國慶連假停課一周</li>
</ul>

<h2>2019/09/22</h2>
<ul>
	<li>幫填個320期的<a href="https://bit.ly/2kYqfeC">問券</a></li>
</ul>

<h2>2019/09/11</h2>
<ul>
	<li>319期期末考試已批改完畢，若無收到回信請告知</li>

<h2>2019/09/04</h2>
<ul>
	<li>13、14章PPT已更新完畢</li>
	<li>HW8更新完畢</li>
</ul>

<h2>2019/09/02</h2>
<ul>
	<li>HW1~7參考答案已上傳<a href="/Course/Cpp/Download/">Download區</a></li>
</ul>

<h2>2019/08/23</h2>
<ul>
	<li>新增作業3-2，若原本的3-2遇到困難可參考</li>
	<li>HW4、HW5、HW6、HW7更新完畢</li>
	<li>318期期末考批改完畢，如未收到回信請來信告知</li>
</ul>

<h2>2019/08/14</h2>
<ul>
	<li>移除物件相關內容，預計放置到進階班</li>
	<li>Homework上傳區修改了，現在可以看到前五筆上傳紀錄!</li>
	<li>HW4-8重新編排中</li>
</ul>

<h2>2019/08/12</h2>
<ul>
	<li>網站排版更新，之後切換頁面不會跑版了</li>
	<li>課程內容更新，進度編排改變</li>
	<li>HW2、HW3更新完畢</li>
</ul>

<h2>2019/08/11</h2>
<ul>
	<li>作業一更新完畢</li>
</ul>

<h2>2019/08/09</h2>
<ul>
	<li>教材預計08/09(五)會將課程目錄更新一版，希望能更貼近初學者的需求</li>
	<ul>
		<li>增加基礎計算機概論(二進位與補數運算)的部分</li>
		<li>增加課程分段與習題/作業</li>
		<li>增加作業次數(四次=>八次)</li>
		<li>增加期末考Demo的選擇</li>
		<li>移除課程中講授物件的部分</li>
		<li>縮減雙重指標的部分、增加參考</li>
		<li>縮減相較抽象的編譯過程</li>
	</ul>
</ul>

<h2>2019/08/04</h2>
<ul>
	<li>期末考試改到219教室</li>
	<li>期末考試(六選一題)已上傳至<a href="/Course/Cpp/Download/">Download區</a>，完成後在下周日(8/11)前寄至lkm543@gmail.com</li>
	<li>作業繳交截止日期也在8/11(日)</li>
	<li>麻煩填個教學問券:<a href="https://forms.gle/9qAQAWcviqf8mmmf7">https://forms.gle/9qAQAWcviqf8mmmf7</a></li>
	<ul>
		<li>本期開課日:2019/07/06</li>
		<li>學號:CB318XXX</li>
		<li>講師姓名:李耕銘</li>
		<li>教室號碼:223B</li>
	</ul>
</ul>

<h2>2019/08/03</h2>
<ul>
	<li>本日08/03(六)因高壓電施工停課乙次</li>
	<li>08/04(日) 09:00-12:00正常上課</li>
	<li>期末考改期至08/04(日) 19:00-22:00，若不克前來，題目公告於Download區可自行撰寫</li>
</ul>

<h2>2019/07/07</h2>
<ul>
	<li>期末考試(六選一題)預計今日晚間批改完</li>
</ul>

<h2>2019/04/13</h2>
<ul>
	<li>期末考試(六選一題)已上傳至<a href="/Course/Cpp/Download/">Download區</a>，完成後請寄至lkm543@hotmail.com</li>
	<li>4/14早上的期末考試，改至4/14(日)的19:00-22:00於108教室舉行</li>
	<li>4/14(日)晚上若不克前來，題目公告於Download區可自行撰寫</li>
	<li>4/6、7清明連假停課一周</li>
	<li>作業參考答案已上傳</li>
</ul>

<h2>2019/01/01</h2>
<ul>
	<li>更新上傳Chapter 14 15的PPT</li>
</ul>

<h2>2017/12/03</h2>
<ul>
	<li>因效益不高且影響網頁瀏覽體驗，移除網頁挖礦</li>
</ul>

<h2>2017/12/01</h2>
<ul>
	<li>影片修改為Youtube連結，增加瀏覽速度，預計12月底~1月中影片更新完畢</li>
</ul>

<h2>2017/10/31</h2>
<ul>
	<li>網站更新，使用Easy Tabs提升瀏覽速度</li>
</ul>
<h2>2017/10/26</h2>
<ul>
	<li>影片新增中，跟Udemy用同版影片，因此編排順序上可能有一點差異</li>
</ul>
<h2>2017/10/13</h2>
<ul>
	<li>PPT模板與內容更新，緩慢更新中，預計一個半月更新完畢</li>
</ul>
<h2>2017/05/18</h2>
<ul>
	<li>新增作業上傳區/後台，以後作業可以直接在此處上傳</li>
</ul>
<h2>2017/05/14</h2>
<ul>
	<li>期末考題目/作業解答/參考資料改放置在網站上的Download區</li>
</ul>
<h2>2017/03/25</h2>
<ul>
	<li>因Dropbox連結失效，更改連結為本地端</li>
	<li>更新部分在備忘稿中的bug</li>
</ul>
<h2>2017/02/07</h2>
<ul>
	<li>HW1~4更新完畢</li>
	<li>更新Resources內容</li>
	<li>更新每一章節的簡介</li>
</ul>
<h2>2016/11/12</h2>
<ul>
	<li>密碼建置完畢，CPP////ILOVECPP</li>
	<li>新增Resources內容</li>
	<li>新增HW1~4</li>
</ul>
<h2>2016/11/01</h2>
<ul>
	<li>系統與網站大綱建置完畢，上課PPT下載連結已連上</li>
	<li>上課PPT的章節有調整過，所以跟舊版不同，但內容是一致的</li>
	<li>課程內容目前尚未開工，影音檔線上播放仍有問題</li>
	<li>目前暫時不需密碼登入，之後會以固定的帳號密碼將其鎖起來</li>
	<li>由於下兩周遇到學校期中考，所以更新進度可能會慢一些</li>
</ul>